/***************************************************************************************************
* 显示进度条
***************************************************************************************************/
#include "prog_bar.h"

#define MAX_PERCENT 102

/***************************************************************************************************
* 功  能：显示进度条
* 参  数：*
*         percent   -I  设置进度条显示的百分比 
* 返回值：状态码         
* 备  注：
***************************************************************************************************/
HKA_STATUS prog_bar_show(HKA_U32 percent)    
{
    // 参数检查, percent需要小于等于100
    if (percent >= MAX_PERCENT)
    {
        return -1;
    }

    // 初始化打印的进度条符号
    HKA_S08 proc[MAX_PERCENT]; 
    memset(proc, '\0', sizeof(proc));     
    memset(proc, '#', percent);

    // 显示进度条
    printf("[%-100s] [%%%d]\r", proc, percent);     // 打印占位宽度为100的进度条                                                                                                                             
    fflush(stdout);     // 刷新屏幕打印
    return 0;
}          